["I love being around you, everything feels so right.",
  "I love seeing your smile, it can make my day instantly better.",
  "I love hearing your laughter, it helps me know that someone understands my jokes.",
  "I love you teaching me Korean, you're so patient with me and encourage me to do better.",
  "I love how good you are at games, I was amazed how good you are at Elden Ring and Baldur's Gate.",
  "I love that you're an Otaku, I love that we can make Otaku jokes and understand references.",
  "I love the way we joke with each other, the way we both say things that are so unexpected.",
  "I love looking into your eyes, I feel like I can see the awesome guy that you see and it makes me more confident.",
  "I love your hands, the way they're so soft, small, and fit perfectly in my hands.",
  "I love that how thoughtful you are, you constantly surprise me with all your small and thoughtful gifts that you've given me.",
  "I love how direct you are with me, you're not afraid of letting me know what's on your mind.",
  "I love that you accept me for who I am, I'm awkward and mess up a lot.",
  "I love that we can talk through our problems openly, because we both want our relationship to be even stronger.",
  "I love our cringey couple moments, we both know its cringey but we don't care because it's fun.",
  "I love how much you take care of me and want to baby me, you make me feel so loved.",
  "I love how much you try to learn about me, you make me feel wanted and that your interested in who I am.",
  "I love that you don't take me for granted, you always appreciate what I do and that you always want to contribute your share.",
  "I love that accept my imperfections, I'm worried about my weird eyelids, my height, and how sweaty I can be; but you accept me for who I am.",
  "I love that you're always thinking of new things we can do together, you're always finding new fun apps or ideas for us to bond over.",
  "I love making Gravy with you 😉, I can't imagine someone so patient and loving as you are.",
  "I love sharing the same brain with you, it's so fun seeing us thinking the same things.",
  "I love how clumsy you can be, it makes me feel a bit better that you're not perfect and that I can be there to support you.",
  "I love how much we think about the future and share the same values of what we want in our relationship.",
  "I love playing board games with you, no matter what, seeing you play makes me so happy.",
  "I love seeing you enjoy food, no matter what it is, you make it look so yummy; even pickles...",
  "I love watching shows with you, it's so fun when we laugh at the same jokes or get angry at the same characters.",
  "I love laying around with you, just the two of us enjoying each other's company.",
  "I love having you as my passenger princess, you make driving fun and we somehow find the funniest drivers together.",
  "I love how understanding you are, that you're able to just enjoy the most out of things like our 4th of July date or Anime Expo.",
  "I love that you're so worried with impressing my friends and family (you shouldn't be), but seeing you care about the other people I love is amazing.",
  "I love how easy it is to talk to you about marriage or ankle biters, it's fun to joke but also good for us to see what we share in common.",
  "I love cuddling with you, I feel like I invented a time machine with how fast time flies when we're just embracing each other.",
  "I love doing puzzles with you, in video games or escape rooms, seeing you think and problem solve is so sexy!",
  "I love hearing you complain and vent, I'm happy that I can help make you feel better and to help you feel justified.",
  "I love shopping with you, it's fun exploring things we need or don't need.",
  "I love doing chores with you, it makes it feel more that we're a team that work together to make our lives better.",
  "I love how much you plan ahead, the way you're proactive and responsible is so hot!",
  "I love how cute you are, the sounds you make or little things you do always make my heart flutter.",
  "I love how silly you are with me, the way we can both keep laughing at a simple joke like watermelon seeds.",
  "I love waking up in the night or in the morning and seeing you there, makes me feel so happy being with someone I love.",
  "I love that we're both each other's first thoughts when we want to share a cute or funny picture.",
  "I love hearing you brag about me to anyone you can, I feel more confident that I'm doing things right with making you feel loved.",
  "I love that your first thought when waking up is to message me (even if it's so early for you), I feel so loved that your thinking of me even in your sleep.",
  "I love that you like to tease me, I know you just want to laugh with me about silly or dumb things I do.",
  "I love that you're patient with my bad memory, you're understanding and brush it off as a chance to tease me more and not get angry.",
  "I love that you always want to match with me, I think it's very cute and that you want us to look cute together.",
  "I love how you react when seeing me on video, it makes me feel embarrassed but also at the same time desired and loved.",
  "I love being mashed potatoes with you, it's always been my dream to spend regular days like this with someone special to me.",
  "I love that you like watching me play video games, it feels like I have my own personal audience and fan that want to see me succeed.",
  "I love that you accept or even match how perverted or dirty I can be, I'm glad we can have intimate moments together.",
  "I love that you find my nerdiness so attractive, I've always known I'm a bit of a nerd, but I'm so lucky to have someone who finds that part of me attractive.",
  "I love that you see my programmer/professional side of me sexy, I hope I can always appear that way for you.",
  "I love spending our weekends together as much as possible, it makes it even harder to go from fun weekends with you to work on Monday.",
  "I love sending Kakao stickers to each other, the maltese and golden retriever really match our relationship well.",
  "I love your lips, they're so lovely and I can't help myself from wanting to kiss them as much as possible.",
  "I love finding cultural differences between us, it's a bit funny but mostly interesting to see how different our habits can be.",
  "I love reading webtoons with you, I can't thank you enough for your recommendations!",
  "I love smelling you, you always smell amazing and it drives me crazy.",
  "I love how you feed me while I'm driving without me asking, I feel so cared for and loved.",
  "I love how much you trust me and that you're willing to share a lot of private and senstive details about your life with me.",
  "I love that you can understand my perspective quickly, so far it has made our conflicts so much faster and instead we can spend the time loving each other.",
  "I love that we're really similar, but we both still have our own individuality that makes our relationship feel so much more interesting.",
  "I love how everything about you is so beautiful, your eyes, your face, your body, I know it might sound perverted, but I can't say it enough about how sexy I find you.",
  "I love how practical you are with the gifts you get me, I really appreciate that we both value thoughtful yet practical gifts.",
  "I love that you're so interested in learning teochew just because you want to impress my family and feel closer to me.",
  "I love how you respect me as a gamer and are ok with me being busy with gaming with my friends.",
  "I love that we have the same amount of need of cleanliness but also the same lazy attitude.",
  "I love how you shared your playstation and nintendo accounts with me so I can enjoy the games you like too.",
  "I love your cooking and also being your sous chef, I want to cook so many meals with you.",
  "I love that we have similar tastes in interior decorating and houses, it was so fun looking at houses with you.",
  "I love that we both love popcorn, even if I like more boring popcorn 😅.",
  "I love that you say you want to eat me or bite, it's a little weird, but I get that it's just your way of expressing that you love me so much and I feel it (sometimes literally).",
  "I love that sometimes we get too greedy and order too much, it sometimes hurts my tummy, but I'm happy to be enjoying food with you.",
  "I love that it's easy sharing drinks or food with you. It feels like we match perfectly where both of us get a fair share and we can equally enjoy it.",
  "I love that we have the same amount of stamina and we take breaks frequently.",
  "I love that we both have the same hobbies and also have the same dislike of physical/outdoor activity.",
  "I love the photos you take of us and that you bear with my bad photography skills.",
  "I love that I feel comfortable with you and that I can tell you anything and you won't judge me, I've never had someone like this before.",
  "I love that you handled my awkward and maybe hasty romantic moves well, I'm so glad you felt the same way and that we can have such an intimate relationship together.",
  "I love how much trust you have put in me and that you've come to rely on me for your problems.",
  "I love that you spend every lunch you can with me just so we can have more time to talk and enjoy each other's company.",
  "I love that you take my concerns and discomfort seriously and make sure that I don't feel that way again.",
  "I love how concerned you are with my health and how much you make sure that I live a long live with you.",
  "I love hearing how much research you put into important things like purchases or visa processes, I feel so comforted that my girlfriend is so diligent.",
  "I love your taste of music, I hear a lot of songs that match my taste, but also a lot of songs I would have never heard of if it weren't for you.",
  "I love how willing your are to rewatch stuff with me so we can share the experience of watching together.",
  "I love that you still put on makeup for me sometimes even when I know how much you don't like putting on makeup, it makes me feel like I'm worth it in your eyes.",
  "I love that you make sure I'm comfortable with things you want, like when you wanted couple rings you wanted to make sure I was ok with it.",
  "I love hearing your game ideas and stories, I really hope one day we can have a DnD campaign together to explore some of your worlds together.",
  "I love falling asleep while on calls with you, it feels kinda like the real thing where it's nice an cozy sleeping side by side.",
  "I love how much you're willing to sacrifice to make our relationship work, I only hope that I can make your sacrifices more than worth it.",
  "I love how you make me feel cool, smart, and handsome; I really feel wanted and desired, and it makes me want to do more to keep you thinking that way of me.",
  "I love teaching you how to program, it's an amazing feeling seeing you light up when your code works or when it makes sense to you.",
  "I love seeing professional Gracy making fantastic videos and PR materials, makes me want to enroll at Mason Korea.",
  "I love hearing about your history and how you got to where you are, I think you had a lot of unique challenges and it made you into such an amazing person!",
  "I love how curious you can get with things you're interested in, video games, art, music, and even me ❤️.",
  "I love hugging you, it feels so natural and perfect hugging you.",
  "I love that you're doing your best to impress me and make me fall in love with you over and over, you're so amazing.",
  "I love that you found a way to love an awkward, boring, weird boyfriend like me, and I'm so lucky that you did.",
  "I love you for who you are, there's nothing I would want to change about you. You're perfect in my eyes, and I can't wait to see how much our relationship grows."
]
