{
  "call_stats": {
    "total_duration": 1275829.0,
    "total_video_duration": 829737.0,
    "total_calls": 430,
    "total_video_calls": 206,
    "duration_by_sender": {
      "Gordon": 260822.0,
      "Gracy": 1015007.0
    },
    "calls_by_sender": {
      "Gordon": 70,
      "Gracy": 360
    },
    "longest_call": 23836.0,
    "longest_video_call": 23836.0,
    "calls_by_weekday": {
      "0": 54,
      "1": 60,
      "2": 57,
      "3": 61,
      "4": 75,
      "5": 55,
      "6": 68
    }
  },
  "message_stats": {
    "total_messages": 30388,
    "total_messages_by_sender": {
      "Gordon": 13571,
      "Gracy": 16817
    },
    "word_count_by_sender": {
      "Gordon": 63084,
      "Gracy": 71700
    },
    "photos_by_sender": {
      "Gordon": 372,
      "Gracy": 709
    },
    "stickers_by_sender": {
      "Gordon": 987,
      "Gracy": 1337
    },
    "laughs_by_sender": {
      "Gordon": 442,
      "Gracy": 1583
    },
    "messages_by_weekday": {
      "0": 5949,
      "1": 5502,
      "2": 6022,
      "3": 4538,
      "4": 1835,
      "5": 1322,
      "6": 5220
    },
    "longest_message_by_sender": {
      "Gordon": {
        "length": 57,
        "message": "I love you so much too 자기. I love hearing you laugh. I love seeing you smile. I love seeing you eat yummy food. You’re always on my mind. I used to day dream about random things. But since falling in love with you I always just remember our time together or picture us making new memories"
      },
      "Gracy": {
        "length": 154,
        "message": "so I spent some time thinking about why. I realized that while her suggestions come from a place of love and concern, they often don't align with what I want, making me feel pressured and uncomfortable. For example, her expectations about my future marriage and other aspects of my life sometimes clash with my own goals, and I end up feeling like I need to comply to avoid disappointing her. because I love her so much and she is my mom.  I'm grateful that she never pressured me about my education or career choices, which allowed me to find my own path. Just like that I want her to understand that while I value her advice, it often becomes a standard I feel I must meet, causing internal conflict. Ultimately, I want her support in my decisions, especially regarding marriage, so I can feel confident and secure knowing that she trusts my judgment."
      }
    }
  }
}